# SANTANDER CODERS: Avaliação Bancos de Dados I

### Imports necessários

In [1]:
import os
import psycopg2
import pandas as pd
from dotenv import load_dotenv
from sqlalchemy import create_engine
from sqlalchemy import MetaData, Table, Column, Integer, String, DDL, Numeric, ForeignKey, Boolean, text

%run assets/dados_categorias.py
%run assets/dados_produtos.py
%run assets/produtos_categorias_data.py

load_dotenv()

True

### Carrega as variáveis de ambiente

In [2]:
USER_POSTEGRES = os.getenv('USER_POSTEGRES')
PASSWORD = os.getenv('PASSWORD')

### Conexão com o banco de dados

In [3]:
engine = create_engine(f'postgresql+psycopg2://{USER_POSTEGRES}:{PASSWORD}@localhost/ada')
conn = engine.connect()

## Consultas SQL simples e complexas em um banco de dados postgres

### Criação das tabelas

In [4]:
metadata = MetaData()

tabela_produtos = Table(
    'produtos',
    metadata,
    Column('id', Integer, primary_key=True),
    Column('nome', String(100), nullable=False),
    Column('preco', Numeric(precision=10, scale=2), nullable=False)
)

tabela_categorias = Table(
    'categorias',
    metadata,
    Column('id', Integer, primary_key=True),
    Column('nome', String(100), nullable=False),
)

metadata.create_all(engine)

In [5]:
tabela_produtos_categorias = Table(
    'produtos_categorias',
    metadata,
    Column('produto_id', Integer, ForeignKey(tabela_produtos.c.id), primary_key=True),
    Column('categoria_id', Integer, ForeignKey(tabela_categorias.c.id), primary_key=True),
)
metadata.create_all(engine)

### Populando as tabelas

#### Produtos

In [6]:
conn.execute(tabela_produtos.insert().values(dados_produtos))

#### Categorias

In [7]:
conn.execute(tabela_categorias.insert().values(dados_categorias))

#### Produtos_categorias

In [8]:
associacao = pd.DataFrame(produtos_categorias_data)
associacao.head(1)

   produto    categoria
0  Celular  Eletrônicos

#### Associa o id da categoria à tabela de asociações

In [9]:
query = """
SELECT
* 
FROM public.categorias
"""

df_categorias = pd.read_sql_query(query, con = conn)
df_categorias.head(1)

   id         nome
0  82  Eletrônicos

In [10]:
mapeamento_categorias = df_categorias.copy().set_index('nome')
mapeamento_categorias_id = mapeamento_categorias.to_dict(orient='dict')['id']
associacao['categoria_id'] = associacao['categoria'].map(mapeamento_categorias_id)

#### Associa o id do produto à tabela de asociações

In [11]:
query = """
SELECT
* 
FROM public.produtos
"""

df_produtos = pd.read_sql_query(query, con = conn)
df_produtos.head(1)

    id     nome   preco
0  541  Celular  1000.0

In [12]:
mapeamento_produtos = df_produtos.copy().set_index('nome')
mapeamento_produtos_id = mapeamento_produtos.to_dict(orient='dict')['id']
associacao['produto_id'] = associacao['produto'].map(mapeamento_produtos_id)

#### Insere os ids na tabela produtos_categorias

In [13]:
dados_categorias_produtos = associacao[['categoria_id', 'produto_id']].to_dict(orient='records')
conn.execute(tabela_produtos_categorias.insert().values(dados_categorias_produtos))

In [14]:
query = """
SELECT
* 
FROM public.produtos_categorias
"""

df_produtos_categorias = pd.read_sql_query(query, con = conn)
df_produtos_categorias.head(1)

   produto_id  categoria_id
0         541            82

### Respostas

#### 3) Liste os nomes de todos os produtos que custam mais de 100 reais, ordenando-os primeiramente pelo preço e em segundo lugar pelo nome. Use alias para mostrar o nome da coluna nome como "Produto" e da coluna preco como "Valor". A resposta da consulta não deve mostrar outras colunas de dados.

In [15]:
query = """
SELECT nome AS Produto, preco AS Valor
FROM public.produtos
WHERE preco > 100
ORDER BY Valor, Produto
"""

response = pd.read_sql_query(query, con = conn)
response

                   produto   valor
0              Micro-ondas   120.0
1                  Relógio   120.0
2         Tênis de Corrida   120.0
3    Cadeira de Escritório   150.0
4                 Frigobar   150.0
5         Jaqueta de Couro   150.0
6              Fogão a Gás   250.0
7           Mesa de Jantar   300.0
8                   Tablet   300.0
9   Máquina de Lavar Roupa   350.0
10   Bicicleta Ergométrica   400.0
11               Bicicleta   500.0
12                    Sofá   600.0
13             Câmera DSLR   800.0
14                Smart TV   900.0
15                 Celular  1000.0
16                  Laptop  1500.0
17                Notebook  2000.0

#### 4) Liste todos os ids e preços de produtos cujo preço seja maior do que a média de todos os preços encontrados na tabela "produtos".

In [16]:
query = """
SELECT id, preco
FROM public.produtos
WHERE preco > (SELECT AVG(preco) FROM produtos)
"""

response = pd.read_sql_query(query, con = conn)
response

     id   preco
0   541  1000.0
1   542  2000.0
2   547   500.0
3   551  1500.0
4   553   800.0
5   556   600.0
6   557   300.0
7   561   900.0
8   564   300.0
9   574   250.0
10  585   350.0
11  587   400.0

#### 5) Para cada categoria, mostre o preço médio do conjunto de produtos a ela associados. Caso uma categoria não tenha nenhum produto a ela associada, esta categoria não deve aparecer no resultado final. A consulta deve estar ordenada pelos nomes das categorias.

In [17]:
query = """
SELECT c.nome AS Categoria, AVG(p.preco) AS PrecoMedio
FROM public.categorias AS c
INNER JOIN produtos_categorias AS pc ON c.id = pc.categoria_id
INNER JOIN produtos AS p ON pc.produto_id = p.id
GROUP BY c.nome
ORDER BY c.nome;
"""

response = pd.read_sql_query(query, con = conn)
response

                   categoria  precomedio
0                 Acessórios   37.333333
1                   Calçados   90.000000
2           Eletrodomésticos   91.785714
3                Eletrônicos  935.714286
4           Esportes e Lazer  180.000000
5         Livros e Papelaria   13.500000
6                     Móveis  211.666667
7  Periféricos de Computador   20.000000
8                     Roupas   53.333333

## Inserções, alterações e remoções de objetos e dados em um banco de dados postgres

In [18]:
metadata = MetaData()

tabela_turma = Table(
    'turma',
    metadata,
    Column('id_turma', Integer, primary_key=True),
    Column('codigo_turma', String(255), nullable=False),
    Column('nome_turma', String(255), nullable=False)
)

tabela_aluno = Table(
    'aluno',
    metadata,
    Column('id_aluno', Integer, primary_key=True, autoincrement=True),
    Column('nome_aluno', String(255), nullable=False),
    Column('aluno_alocado', Boolean),
    Column('id_turma', Integer, ForeignKey(tabela_turma.c.id_turma), primary_key=True),
)

metadata.create_all(engine)

### 7) Agora que você demonstrou que consegue ser mais do que um simples usuário do banco de dados, mostre separadamente cada um dos códigos DML necessários para cumprir cada uma das etapas a seguir:

#### a) Inserir pelo menos duas turmas diferentes na tabela de turma;

In [19]:
novas_turmas = [
    {'codigo_turma': 'T0ST', 'nome_turma': 'Sem turma'},
    {'codigo_turma': 'T1ML', 'nome_turma': 'Turma Machine Learning'},
    {'codigo_turma': 'T2DS', 'nome_turma': 'Turma Data Science'}
]

conn.execute(tabela_turma.insert().values(novas_turmas))

#### b) Inserir pelo menos 1 aluno alocado em cada uma destas turmas na tabela aluno (todos com NULL na coluna aluno_alocado);

In [20]:
novos_alunos = [
    {'nome_aluno': 'Abdias Nascimento', 'aluno_alocado': None, 'id_turma': 2},
    {'nome_aluno': 'Maria Carolina de Jesus', 'aluno_alocado': None, 'id_turma': 3}
]

conn.execute(tabela_aluno.insert().values(novos_alunos))

#### c) Inserir pelo menos 2 alunos não alocados em nenhuma turma na tabela aluno (todos com NULL na coluna aluno_alocado);

In [21]:
alunos_sem_turma = [
    {'nome_aluno': 'Conceição Evaristo', 'aluno_alocado': None, 'id_turma': 1},
    {'nome_aluno': 'Lélia González', 'aluno_alocado': None, 'id_turma': 1}
]

conn.execute(tabela_aluno.insert().values(alunos_sem_turma))

#### d) Atualizar a coluna aluno_alocado da tabela aluno, de modo que os alunos associados a uma disciplina recebam o valor True e alunos não associdos a nenhuma disciplina recebam o falor False para esta coluna.

In [22]:
query = text("""
UPDATE public.aluno
SET aluno_alocado = CASE
    WHEN id_turma = 1 THEN false
    ELSE true
END
""")

conn.execute(query)

#### Visualização resultado

In [23]:
query = """
SELECT
* 
FROM public.turma
"""

turma = pd.read_sql_query(query, con = conn)
turma

   id_turma codigo_turma              nome_turma
0         1         T0ST               Sem turma
1         2         T1ML  Turma Machine Learning
2         3         T2DS      Turma Data Science

In [24]:
query = """
SELECT
* 
FROM public.aluno
"""

aluno = pd.read_sql_query(query, con = conn)
aluno

   id_aluno               nome_aluno  aluno_alocado  id_turma
0         1        Abdias Nascimento           True         2
1         2  Maria Carolina de Jesus           True         3
2         3       Conceição Evaristo          False         1
3         4           Lélia González          False         1